Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The data source APIs handle the serialization and deserialization automatically. When a non-standard type is used, the object is serialized into JSON and deserialized from JSON. In this case, `quarkus-jackson` is used.
ja_jp: データソース API は、シリアライズとデシリアライズを自動的に処理します。非標準のタイプが使われる場合、オブジェクトは JSON にシリアライズされ、JSON からデシリアライズされます。この場合、 `quarkus-jackson` が使用されます。

source: The data was found locally, so return it
ja_jp: ローカルにデータが見つかったので、それを返す

source: The database Dev Services will be enabled when a reactive or JDBC datasource extension is present in the application, and the database URL has not been configured. More information can be found at the xref:databases-dev-services.adoc[Databases Dev Services Guide].
ja_jp: データベース Dev Services は、アプリケーションにリアクティブ・データソースまたは JDBC データソースエクステンションが存在し、データベースの URL が構成されていない場合に有効になります。詳細については、 link:datasource.html#dev-services[データソース・ガイド]を参照してください。

source: The database Dev Services will be enabled when a reactive or JDBC datasource extension is present in the application, and the database URL has not been configured. More information can be found at the xref:datasource.adoc#dev-services[Datasource Guide].
ja_jp: データベース Dev Services は、アプリケーションにリアクティブ・データソースまたは JDBC データソース拡張が存在し、データベースの URL が構成されていない場合に有効になります。詳細については、 link:datasource.html#dev-services[データソース・ガイド]を参照してください。

source: The database Dev Services will be enabled when a reactive or JDBC datasource extension is present in the application, and the database URL has not been configured. More information can be found in the xref:databases-dev-services.adoc[Databases Dev Services Guide].
ja_jp: データベース Dev Services は、アプリケーションにリアクティブ・データソースまたは JDBC データソースエクステンションが存在し、データベースの URL が設定されていない場合に有効になります。詳細については、 link:datasource.html#dev-services[データソース・ガイド]を参照してください。

source: The database connection url must be configured so that the `host` is the socket path.
ja_jp: データベース接続 URL は、 `host` がソケットパスになるように設定する必要があります。

source: The database connection url must be configured so that:
ja_jp: データベース接続の URL は、次のように設定する必要があります。

source: The database is being managed using xref:dev-services.adoc[Dev Services]. Dev Services take care of stopping and starting services needed by your application. Because you included the `jdbc-postgresql` dependency, the database is a containerised PostgreSQL database. If you'd added `jdbc-mysql` instead, you would have gotten a containerised MySQL database.
ja_jp: データベースは xref:dev-services.adoc[Dev Services] を使用して管理されています。 Dev Services は、アプリケーションに必要なサービスの停止と開始を処理します。 `jdbc-postgresql` 依存関係を含めたため、データベースはコンテナー化された PostgreSQL データベースです。 代わりに `jdbc-mysql` を追加した場合は、コンテナー化された MySQL データベースが取得されたはずです。

source: The database kind defines which type of database you will connect to.
ja_jp: データベースの種類は、接続するデータベースの種類を定義します。

source: The database schema Hibernate Search will expect for outbox-polling coordination may be customized through the following configuration properties:
ja_jp: データベーススキーマ Hibernate Search は、outbox-polling 調整が次の設定プロパティーに従ってカスタマイズされることを期待します。

source: The database selection priority order is as follow: `@MongoEntity(database="mizain")`, `MongoDatabaseResolver`, and then `quarkus.mongodb.database` property.
ja_jp: データベース選択の優先度は、 `@MongoEntity(database="mizain")`、 `MongoDatabaseResolver`、 `quarkus.mongodb.database` プロパティーの順です。

source: The datasource does not attempt to connect to the database during application startup.
ja_jp: アプリケーションの起動時に、データソースがデータベースに接続しようとしません。

source: The datasource does not contribute a <<datasource-health-check,health check>>.
ja_jp: データソースは xref:datasource-health-check[ヘルスチェック] を行いません。

source: The decision logic for the `Base price` Decision node shall be a DMN Decision Table with the following entries:
ja_jp: `Base price` Decisionノードの意思決定ロジックは、以下のような DMN Decision Table とします:

source: The decorator may invoke any method of the delegate object. And the container invokes either the next decorator in the chain or the business method of the intercepted instance.
ja_jp: デコレーターは、デリゲートオブジェクトの任意のメソッドを呼び出すことができます。そして、コンテナは、チェーンの次のデコレーターか、インターセプトされたインスタンスのビジネスメソッドを呼び出します。

source: The deep integration with Kubernetes futher minimized complexity and brought our services closer to being cloud native. Our DevOps engineer, who used to be a developer, says it best:
ja_jp: また、Kubernetesとの深い連携により、複雑さを最小限に抑え、当社のサービスをよりクラウドネイティブに近づけることができました。以前はデベロッパーだった当社のDevOpsエンジニアが、このように語っています。

source: The deeper we explored Quarkus, the more we began to appeciate other aspects:
ja_jp: Quarkusを深く掘り下げれば掘り下げるほど、他の側面にも魅力を感じるようになりました。

source: The default ID token age is 5 minutes, which you can extend further as described in the <<session-management,session management>> section.
ja_jp: ID トークンの有効期間はデフォルトで 5 分ですが、<<session-management,セッション管理>> セクションで説明されているとおり延長できます。

source: The default Maven feature to go offline doesn't download the full set of Quarkus artifacts as some artifacts (the deployment/build ones) are resolved by the Quarkus Maven plugin and are not part of the regular dependencies.
ja_jp: オフラインにするためのデフォルトのMaven機能では、Quarkusのアーティファクトの完全なセットはダウンロードされません。なぜなら、いくつかのアーティファクト（デプロイ/ビルドのもの）はQuarkus Mavenプラグインによって解決され、通常の依存関係の一部ではないからです。

source: The default Mutiny thread pool is the Quarkus worker thread pool;
ja_jp: Mutinyのデフォルトのスレッドプールは、Quarkusのワーカースレッドプールです。

source: The default Quarkus runtime profile is set to the profile used to build the application:
ja_jp: デフォルトの Quarkus 実行時プロファイルは、アプリケーションのビルドに使用されるプロファイルに設定されます。

source: The default Quarkus test port configuration (`quarkus.http.test-port`) will be honored and if you set it to 0 a random port will be assigned to the function invoker.
ja_jp: デフォルトのQuarkusテストポート設定 ( `quarkus.http.test-port` ) が優先され、0に設定するとランダムなポートが関数呼び出し元に割り当てられます。

source: The default STM container (`org.jboss.stm.Container`) provides support for volatile objects that can only be shared between threads in the same microservice/JVM instance. When a STM-aware object is placed into the container it returns a handle through which that object should then be used in the future. It is important to use this handle as continuing to access the object through the original reference will not allow the STM subsystem to track access and manage state and concurrency control.
ja_jp: デフォルトの STM コンテナー (`org.jboss.stm.Container`) は、同じマイクロサービス/JVM インスタンス内のスレッド間でのみ共有可能な揮発性オブジェクトをサポートしています。STM を意識したオブジェクトがコンテナーに置かれると、そのオブジェクトが将来的に使用されるべきハンドルを返します。元の参照を介してオブジェクトにアクセスし続けると、STM サブシステムがアクセスを追跡したり、状態や同時実行制御を管理したりすることができなくなるため、このハンドルを使用することが重要です。

source: The default STM container (`org.jboss.stm.Container`) provides support for volatile objects that can only be shared between threads in the same microservice/JVM instance. When an STM-aware object is placed into the container it returns a handle through which that object should then be used in the future. It is important to use this handle as continuing to access the object through the original reference will not allow the STM subsystem to track access and manage state and concurrency control.
ja_jp: デフォルトの STM コンテナー (`org.jboss.stm.Container`) は、同じマイクロサービス/JVM インスタンス内のスレッド間でのみ共有可能な揮発性オブジェクトをサポートしています。STM を意識したオブジェクトがコンテナーに置かれると、そのオブジェクトが将来的に使用されるべきハンドルを返します。元の参照を介してオブジェクトにアクセスし続けると、STM サブシステムがアクセスを追跡したり、状態や同時実行制御を管理したりすることができなくなるため、このハンドルを使用することが重要です。

source: The default TLS configuration is not a fallback or global configuration. Each named TLS configuration, or "TLS bucket," must provide its own properties. For instance, `quarkus.tls.reload-period` applies only to the default TLS configuration.
ja_jp: デフォルトの TLS 設定は、フォールバックまたはグローバル設定ではありません。名前付き TLS 設定 (または「TLS バケット」) は、それぞれ独自のプロパティーを提供する必要があります。たとえば、`quarkus.tls.reload-period` はデフォルトの TLS 設定のみに適用されます。

source: The default TLS configuration is not a fallback or global configuration. Each named TLS configuration, or "TLS bucket," must provide its own properties. For instance, `quarkus.tls.reload-period` will only be applied to the default TLS configuration.
ja_jp: デフォルトの TLS 設定は、フォールバック/グローバル設定ではありません。 名前付き TLS 設定 (または TLS バケット) はそれぞれ独自のプロパティーを提供する必要があります。 たとえば、`quarkus.tls.reload-period` はデフォルトの TLS 設定のみに適用されます。

source: The default `TokenStateManager` encrypts the tokens before storing them in the session cookie. The following example shows how you configure it to split the tokens and encrypt them:
ja_jp: デフォルトの `TokenStateManager` は、トークンをセッションクッキーに保存する前に暗号化します。 次の例は、トークンを分割して暗号化するように設定する方法を示しています。

source: The default `service` application type is used when a `bearer` access token is sent with an HTTP `Authorization: Bearer <token>` header to access the Quarkus application. For example, a `Single-page application` (SPA) can use access tokens to access Quarkus on behalf of the currently logged-in SPA user.
ja_jp: デフォルトの `service` アプリケーションタイプは、 Quarkus アプリケーションにアクセスするために HTTP `Authorization: Bearer <token>` ヘッダーとともに `bearer` アクセストークンが送信される場合に使用されます。たとえば、 `シングルページアプリケーション` (SPA) は、現在ログインしている SPA ユーザーに代わって Quarkus にアクセスするためにアクセストークンを使用できます。

source: The default behaviour of Jackson can be restored by setting `quarkus.jackson.write-dates-as-timestamps=true` in your `application.properties`. If you want to change the format for a single field, you can use the `@JsonFormat` annotation.
ja_jp: `application.properties` で `quarkus.jackson.fail-on-unknown-properties=true` を設定するか、 `@JsonIgnoreProperties(ignoreUnknown = false)` を経由してクラスごとに設定することで、Jackson のデフォルトの動作を復元することができます。

source: The default cache max-age is `60s`. It can be configured by setting `quarkus.security.ldap.cache.max-age`.
ja_jp: デフォルトのキャッシュ max-age は `60s` です。 `quarkus.security.ldap.cache.max-age` を設定することで設定できます。

source: The default cache uses a token as a key and each entry can have `TokenIntrospection` and/or `UserInfo`. It will only keep up to a `max-size` number of entries. If the cache is full when a new entry is to be added then an attempt will be made to find a space for it by removing a single expired entry. Additionally, the clean up timer, if activated, will periodically check for the expired entries and remove them.
ja_jp: デフォルトのキャッシュはトークンをキーとして使用し、各エントリーは `TokenIntrospection` や `UserInfo` を持つことができます。 `max-size` のエントリー数までしか保持しません。新しいエントリーを追加するときにキャッシュがいっぱいな場合、期限切れのエントリーを 1 つ削除して、スペースを見つけようとします。さらに、クリーンアップタイマーがアクティブになっている場合は、期限切れのエントリーを定期的にチェックして削除します。

source: The default cache uses a token as a key and each entry can have `TokenIntrospection` and/or `UserInfo`. It will only keep up to a `max-size` number of entries. If the cache is full when a new entry is to be added then an attempt will be made to find a space for it by removing a single expired entry. Additionally, the cleanup timer, if activated, will periodically check for the expired entries and remove them.
ja_jp: デフォルトのキャッシュはトークンをキーとして使用し、各エントリーは `TokenIntrospection` や `UserInfo` を持つことができます。 `max-size` のエントリー数までしか保持しません。新しいエントリーを追加するときにキャッシュがいっぱいな場合、期限切れのエントリーを 1 つ削除して、スペースを見つけようとします。さらに、クリーンアップタイマーがアクティブになっている場合は、期限切れのエントリーを定期的にチェックして削除します。

source: The default cache uses a token as a key, and each entry can have `TokenIntrospection`, `UserInfo`, or both. It will only keep up to a `max-size` number of entries. If the cache is already full when a new entry is to be added, an attempt is made to find a space by removing a single expired entry. Additionally, the cleanup timer, if activated, periodically checks for expired entries and removes them.
ja_jp: デフォルトのキャッシュは、トークンをキーとして使用します。各エントリーには、 `TokenIntrospection`、 `UserInfo`、またはその両方が含まれます。 最大で `max-size` 個のエントリーのみが保持されます。 新しいエントリーを追加するときにキャッシュがすでにいっぱいになっている場合は、期限切れのエントリーを 1 つ削除して領域を確保する試みが行われます。 さらに、クリーンアップタイマーを有効にすると、期限切れのエントリーが定期的にチェックされ、削除されます。

source: The default config source from Quarkus provides a random UUID value. It generates the UUID at startup time. So, the value changes between startups, including reloads in dev mode.
ja_jp: Quarkus のデフォルトの設定ソースはランダムな UUID 値を提供します。起動時に UUID を生成します。そのため、開発モードでのリロードを含め、スタートアップ間で値が変化します。

source: The default configuration may look like this:
ja_jp: デフォルトの設定は次のようになります。

source: The default configuration profile of the first execution of the plugin is `prod-oracle`.
ja_jp: プラグインの最初の実行のデフォルトの設定プロファイルは `prod-oracle` です。

source: The default configuration profile of the second execution of the plugin is `prod-postgresql`.
ja_jp: プラグインの 2 回目の実行のデフォルトの設定プロファイルは `prod-postgresql` です。

source: The default configuration profile of this project is `prod-aws`.
ja_jp: このプロジェクトのデフォルトの設定プロファイルは `prod-aws` です。

source: The default connection is configured using the `quarkus.infinispan-client.*` properties as seen above. When using the default connection, you can inject using a _plain_ `@Inject`:
ja_jp: デフォルトの接続は、上記のように `quarkus.infinispan-client.*` プロパティを使用して設定します。デフォルトの接続を使用する場合、 _プレーンな_ `@Inject` を使用してインジェクトすることができます：

source: The default connection is configured using the `quarkus.redis.*` properties. For example, to configure the default Redis client, use:
ja_jp: デフォルトの接続は、 `quarkus.redis.*` プロパティーを使用して設定されます。たとえば、デフォルトの Redis クライアントを設定するには、以下を使用します。

source: The default data source will be used for all tenants. All entities defining a field annotated with `@TenantId` will have that field populated automatically, and will get filtered automatically in queries.
ja_jp: デフォルトのデータソースがすべてのテナントに使用されます。 `@TenantId` でアノテーションされたフィールドを定義しているすべてのエンティティには、そのフィールドが自動的に入力され、クエリで自動的にフィルタリングされます。

source: The default datasource - using PostgreSQL.
ja_jp: デフォルトのデータソース - PostgreSQL を使用。

source: The default document and all of the named documents support the same configuration. There is a minor pitfall with the MicroProfile OpenAPI configuration though - MicroProfile-specific configuration properties apply to all documents; see the following examples.
ja_jp: デフォルトのドキュメントとすべての名前付きドキュメントは、同じ設定をサポートしています。ただし、MicroProfile OpenAPI の設定には小さな落とし穴があります。MicroProfile 固有の設定プロパティーはすべてのドキュメントに適用されます。以下の例を参照してください。

source: The default encoding for multipart requests in RESTEasy is US-ASCII which is not very convenient in 2020.
ja_jp: RESTEasyでのマルチパートリクエストのデフォルトエンコーディングはUS-ASCIIで、2020年にはあまり便利ではありません。

source: The default exception mapper can be disabled by setting `quarkus.rest-client.bar.disable-default-mapper=true` to disable the exception mapper for the REST Client configured with the key `bar`.
ja_jp: デフォルトの例外マッパーは、 `quarkus.rest-client.bar.disable-default-mapper=true` を設定して、キー `bar` で設定された REST Client の例外マッパーを無効にすることで無効にできます。

source: The default executor is returned by `io.smallrye.mutiny.infrastructure.Infrastructure` and it is already configured and managed by Quarkus.
ja_jp: デフォルトのエクゼキュータは、 `io.smallrye.mutiny.infrastructure.Infrastructure` によって返却され、Quarkusによってすでに設定、管理されています。

source: The default flow control window is 1MB. Increasing this value can improve throughput when receiving large messages from the server.
ja_jp: デフォルトのフロー制御ウィンドウは 1MB です。この値を増やすと、サーバーから大容量メッセージを受信する際のスループットが向上する可能性があります。

source: The default gauge records `Double` values, but if you want to record `Long` values, you can use
ja_jp: デフォルトのゲージは Double 値を記録しますが、Long 値を記録する場合は、以下を使用できます。

source: The default hostname verifier is set to `NONE`, meaning it does not verify the host name. You can change this behavior by setting the `quarkus.redis.tls.hostname-verification-algorithm` property, to `HTTPS` for example.
ja_jp: デフォルトのホスト名検証は `NONE` に設定されており、この設定ではホスト名は検証されません。この動作は、 `quarkus.redis.tls.hostname-verification-algorithm` プロパティーを、 `HTTPS` などに設定して変更できます。

source: The default image for the LRA coordinator is `quay.io/jbosstm/lra-coordinator`. You can configure the image used by Dev Services for LRA coordinator using the `quarkus.lra.devservices.image-name` property. You can browse the available images at https://quay.io/repository/jbosstm/lra-coordinator?tab=tags.
ja_jp: LRA コーディネーターのデフォルトイメージは `quay.io/jbosstm/lra-coordinator` です。`quarkus.lra.devservices.image-name` 設定プロパティーを使用して、LRA コーディネーター 用 Dev Services が使用するイメージを設定できます。利用可能なイメージは https://quay.io/repository/jbosstm/lra-coordinator?tab=tags で参照できます。

source: The default implementation allows you to define permissions using config in `application.properties`. An example config is shown below:
ja_jp: デフォルトの実装では、 `application.properties` の 設定を使用してパーミッションを定義することができます。以下に config の例を示します。

source: The default in GraalVM seems meant to optimise for short lived processes.
ja_jp: GraalVMのデフォルト値は、短命なプロセスに最適化することを意図しているようです。

source: The default in GraalVM seems meant to optimise for short-lived processes.
ja_jp: GraalVMのデフォルト値は、短命なプロセスに最適化することを意図していると思われます。

source: The default key resolver refreshes the `JsonWebKey` set containing the keys, which involves a remote call to the OIDC endpoint.
ja_jp: デフォルトのキーリゾルバーが、OIDCエンドポイントへのリモートコールを伴うキーを含む `JsonWebKey` セットを更新します

source: The default locale specified via the `quarkus.default-locale` config property is used for the `@MessageBundle` interface by default. However, the `io.quarkus.qute.i18n.MessageBundle#locale()` can be used to specify a custom locale. Additionally, there are two ways to define a localized bundle:
ja_jp: デフォルトでは、`@MessageBundle` インターフェイスには `quarkus.default-locale` 設定プロパティーで指定したデフォルトロケールが使用されます。しかし、`io.quarkus.qute.i18n.MessageBundle#locale()` を使用して、カスタムのロケールを指定することができます。さらに、ローカライズされたバンドルを定義するには、以下の 2 つの方法があります。

source: The default log level for every log category.
ja_jp: 各ログカテゴリのデフォルトのログレベル。

source: The default map adapter can to overridden with our own implementation.
ja_jp: デフォルトのマップアダプタは、独自の実装でオーバーライドすることができます。

source: The default minimum log level for every log category.
ja_jp: 各ログカテゴリのデフォルトの最小ログレベル。

source: The default object lifecycle for a Funqy class is `@Dependent`.
ja_jp: Funqy クラスのデフォルトのオブジェクトライフサイクルは `@Dependent` となります。

source: The default one which will contain all the model classes under the `org.acme.model.defaultpu` package, subpackages included.
ja_jp: デフォルトでは、 `org.acme.model.defaultpu` パッケージのすべてのモデルクラスが含まれ、サブパッケージも含まれます。

source: The default one,
ja_jp: デフォルトのものです。

source: The default persistence unit points to the default datasource by default. For named persistence units, the `datasource` property is mandatory. You can point your persistence unit to the default datasource by setting it to `<default>` (which is the internal name of the default datasource).
ja_jp: デフォルトの永続化ユニットは、デフォルトでデフォルトデータソースを指します。 名前付きの永続化ユニットの場合は、 `datasource` プロパティーが必須です。 `<default>` (デフォルトのデータソースの内部名) に設定することで、永続化ユニットをデフォルトデータソースを指すようにすることができます。

source: The default precedence rules (higher precedence wins) can be overridden by parentheses.
ja_jp: デフォルトの優先順位ルール (優先順位の高いものが優先) は括弧で上書きできます。

source: The default prerequisites
ja_jp: デフォルトの前提条件

source: The default priorities can be overridden using the configuration properties listed below.
ja_jp: デフォルトの優先度は、以下にリストされている設定プロパティーを使用して上書きできます。

source: The default realm name is `quarkus` and client id is `quarkus-web-app` - set `keycloak.realm` and `keycloak.web-app.client` system properties to customize the values if needed.
ja_jp: デフォルトのレルム名は `quarkus` で、クライアント ID は `quarkus-web-app` です。必要に応じて、 `keycloak.realm` と `keycloak.web-app.client` システムプロパティーを設定して値をカスタマイズします。

source: The default registry Maven repository configuration can actually be overridden in the user `settings.xml` by simply adding the desired `<repository>` configuration with the `registry.quarkus.io` as its `<id>` value. If such a repository configuration is found in the user `settings.xml`, the dev tools will use it in place of the default <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Maven repository configuration shown above.
ja_jp: デフォルトのレジストリ Maven リポジトリ設定は、実際にはユーザー `settings.xml` において、 `registry.quarkus.io` をその `<id>` の値として希望の `<repository>` 設定を追加するだけで、上書きすることができます。そのようなリポジトリ構成がユーザー `settings.xml` で見つかった場合、開発ツールは上述のデフォルトの <<registry.quarkus.io.maven.repo,registry.quarkus.io>> リポジトリ構成の代わりにそれを使用します。

source: The default registry Maven repository configuration can actually be overridden in the user `settings.xml` by simply adding the desired `<repository>` configuration with the `registry.quarkus.io` as its `<id>` value. If such a repository configuration is found in the user `settings.xml`, the dev tools will use it in place of the default xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Maven repository configuration shown above.
ja_jp: デフォルトのレジストリMavenリポジトリ設定はユーザー `settings.xml` で、 `registry.quarkus.io` を `<id>` 値として希望の `<repository>` 構成を追加するだけで上書きすることができます。ユーザー `settings.xml` にそのようなリポジトリ設定がある場合、開発ツールは、上記のデフォルトの xref:registry.quarkus.io.maven.repo[registry.quarkus.io] Maven リポジトリ設定の代わりに、そのリポジトリを使用します。

source: The default registry Maven repository configuration can actually be overriden in the user `settings.xml` by simply adding the desired `<repository>` configuration with the `registry.quarkus.io` as its `<id>` value. If such a repository configuration is found in the user `settings.xml`, the dev tools will use it in place of the default <<registry.quarkus.io.maven.repo,registry.quarkus.io>> Maven repository configuration shown above.
ja_jp: デフォルトのレジストリ Maven リポジトリ設定は、実際にはユーザー `settings.xml` において、 `registry.quarkus.io` をその `<id>` の値として希望の `<repository>` 設定を追加するだけで、上書きすることができます。そのようなリポジトリ構成がユーザー `settings.xml` で見つかった場合、開発ツールは上述のデフォルトの <<registry.quarkus.io.maven.repo,registry.quarkus.io>> リポジトリ構成の代わりにそれを使用します。

source: The default resolution for a tenant identifier is convention based, whereby the authentication request must include the tenant identifier in one of the path segments of the request path.
ja_jp: テナント識別子のデフォルトの解決は規則に基づいており、認証リクエストにはリクエストパスのパスセグメントのいずれかにテナント識別子を含める必要があります。

source: The default resolution for a tenant identifier is convention based, whereby the authentication request must include the tenant identifier in the last segment of the request path.
ja_jp: テナント識別子のデフォルトの解決は規則に基づいており、認証要求には要求パスの最後のセグメントにテナント識別子が含まれている必要があります。

source: The default route prefix for an Azure Function is `/api`. All of your JAX-RS, Servlet, Reactive Routes, and xref:funqy-http.adoc[Funqy HTTP] endpoints must explicitly take this into account. In the generated project this is handled by the `quarkus.http.root-path` switch in `application.properties`
ja_jp: Azure Function のデフォルトのルートプレフィックスは `/api` です。全てのJAX-RS、Servlet、Reactive Routes、 xref:funqy-http.adoc[Funqy HTTP] エンドポイントは、これを明示的に考慮する必要があります。生成されたプロジェクトでは、これは `quarkus.http.root-path` のスイッチによって処理されます。 `application.properties`

source: The default route prefix for an Azure Function is `/api`. All of your Jakarta REST, Servlet, Reactive Routes, and xref:funqy-http.adoc[Funqy HTTP] endpoints must explicitly take this into account. In the generated project this is handled by the `quarkus.http.root-path` switch in `application.properties`
ja_jp: Azure Functionのデフォルトのルートプレフィックスは、 `/api` です。Jakarta REST、Servlet、Reactive Routes、xref:funqy-http.adoc[Funqy HTTP] のすべてのエンドポイントでは、これを明示的に考慮する必要があります。生成されたプロジェクトでは、 `application.properties` 内の `quarkus.http.root-path` のスイッチによって処理されます。

source: The default route prefix for an Azure Function is `/api`. All of your Jakarta REST, Servlet, Reactive Routes, and xref:funqy-http.adoc[Funqy HTTP] endpoints must explicitly take this into account. In the generated project, this is handled by the `quarkus.http.root-path` switch in `application.properties`
ja_jp: Azure Function のデフォルトのルートプレフィックスは `/api` です。Jakarta REST、Servlet、Reactive Routes、および xref:funqy-http.adoc[Funqy HTTP] のすべてのエンドポイントでは、これを明示的に考慮する必要があります。生成されたプロジェクトでは、`application.properties` 内の `quarkus.http.root-path` のスイッチによって処理されます。

source: The default routing key to use when sending messages to the exchange Type: _string_
ja_jp: エクスチェンジにメッセージを送信するときに使用するデフォルトのルーティングキー Type: _string_

source: The default secret handler uses the `AES/GCM/NoPadding` algorithm and requires the expression `${aes-gcm-nopadding::value}` to decrypt the `value`.
ja_jp: デフォルトのシークレットハンドラーは `AES/GCM/NoPadding` アルゴリズムを使用し、 `value` を復号するために `${aes-gcm-nopadding::value}` 式を必要とします。
